In [36]:
import pandas as pd

In [48]:
file = "USAT_Data.csv"
usat = pd.read_csv(file)
usat.head()

,Rank,First_Name,Last_Name,Sex,Age,State,Time,Points,Race
0,1,Michael,Alexander,M,50-60,FL,01:02:29.000,87.912,Bartow Blarney Triathlon
1,2,Mark,Hulbert,M,50-60,FL,01:04:06.000,85.695,Bartow Blarney Triathlon
2,3,Brian,Durden,M,30-40,FL,01:05:30.000,83.863,Bartow Blarney Triathlon
3,4,Rodney,Carter,M,40-50,FL,01:05:54.000,83.354,Bartow Blarney Triathlon
4,5,James,Hooppaw,M,20-30,FL,01:06:10.000,83.018,Bartow Blarney Triathlon

In [49]:
usat.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 367 entries, 0 to 366
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Rank        367 non-null    int64
 1   First_Name  367 non-null    object
 2   Last_Name   367 non-null    object
 3   Sex         367 non-null    object
 4   Age         367 non-null    object
 5   State       364 non-null    object
 6   Time        367 non-null    object
 7   Points      366 non-null    float64
 8   Race        367 non-null    object
dtypes: float64(1), int64(1), object(7)
memory usage: 25.9+ KB

In [41]:
file = "NSGAdatapn.csv"
nsga = pd.read_csv(file)
nsga.head()

      First      Last State          Time  gender    age  Rank
0      Dave  CAMPBELL    CA  01:09:09.000    Male  60-64     1
1   Derrill     STEPP    CA  01:10:31.000    Male  55-59     2
2      Ross    REMBAC    AZ  01:11:19.000    Male  50-54     3
3   Vanessa      COOK    NV  01:11:54.000  Female  50-54     4
4     Louis   SALAZAR    NM  01:12:30.000    Male  55-59     5

In [50]:
nsga = nsga.rename(columns = {"age": "Age", "gender": "Sex"})

In [51]:
nsga.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 106 entries, 0 to 105
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   First   106 non-null    object
 1   Last    106 non-null    object
 2   State   106 non-null    object
 3   Time    106 non-null    object
 4   Sex     106 non-null    object
 5   Age     106 non-null    object
 6   Rank    106 non-null    int64
dtypes: int64(1), object(6)
memory usage: 5.9+ KB

In [74]:
merge_df = pd.merge(nsga, usat, on= "State", how = 'inner')

In [75]:
merge_df

,First,Last,State,Time_x,Sex_x,Age_x,Rank_x,Rank_y,First_Name,Last_Name,Sex_y,Age_y,Time_y,Points,Race
0,Dave,CAMPBELL,CA,01:09:09.000,Male,60-64,1,2,Dustin,Duncan,M,10-20,01:04:02.000,98.897,UCSB Kendra's Race Triathlon
1,Dave,CAMPBELL,CA,01:09:09.000,Male,60-64,1,3,Jake,Tennant,M,20-30,01:04:36.000,98.030,UCSB Kendra's Race Triathlon
2,Dave,CAMPBELL,CA,01:09:09.000,Male,60-64,1,4,Mark,Hermes,M,20-30,01:05:19.000,96.954,UCSB Kendra's Race Triathlon
3,Dave,CAMPBELL,CA,01:09:09.000,Male,60-64,1,5,Calum,Rickard,M,20-30,01:05:58.000,95.999,UCSB Kendra's Race Triathlon
4,Dave,CAMPBELL,CA,01:09:09.000,Male,60-64,1,6,Kyle,Visin,M,30-40,01:06:21.000,95.444,UCSB Kendra's Race Triathlon
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1335,Patsy,LILLEHEI,MN,02:54:41.000,Female,75-79,106,12,Sophie,Rabino,F,20-30,00:44:29.000,94.841,Winter Wonderland Triathlon
1336,Patsy,LILLEHEI,MN,02:54:41.000,Female,75-79,106,16,Nathan,Mueggenberg,M,20-30,00:44:57.000,85.323,Winter Wonderland Triathlon
1337,Patsy,LILLEHEI,MN,02:54:41.000,Female,75-79,106,18,Miguel,Anselmo,M,20-30,00:45:21.000,84.571,Winter Wonderland Triathlon
1338,Patsy,LILLEHEI,MN,02:54:41.000,Female,75-79,106,2,Garrett,Williams,M,20-30,00:34:22.380,94.772,Tri-owa Indoor Triathlon
1339,Patsy,LILLEHEI,MN,02:54:41.000,Female,75-79,106,5,Benjamin,Leiran,M,20-30,00:37:29.260,86.897,Tri-owa Indoor Triathlon